window.DataPool = window.DataPool || {};

window.DataPool.ROLES = {
    solo: {
        label: "Соло",
        ability: "<b>Боевое Чутье</b><br>Ролевая способность Соло — Боевое Чутье. С боевым чутьём Соло может использовать свои умения, чтобы лучше контролировать поле боя. Когда начинается бой, в любое время вне боя или в бою действием, Соло может разделить общее количество очков, которое у него есть в его Ролевой Способности Боевое Чутье между своими несколькими боевыми способностями. Если Соло решает не менять распределение очков, его предыдущие значения сохраняются. Активация некоторых из этих способностей будет стоить Соло больше очков, чем других.",
        link: "/job/solo/"
    },

    netrunner: {
        label: "Нетраннер",
        ability: "<b>Интерфейс</b><br>Ролевая способность Нетраннера — интерфейс. Интерфейс — это то, что позволяет Нетраннеру осуществлять нетран — взаимодействовать с электронными модемами разума (называемыми кибердеками) для управления компьютерами, электроникой и связанными с ними программами. Ролевая способность Интерфейс также дает Нетраннеру доступ к широкому набору способностей, связанных со взломом компьютеров и контролем систем.",
        link: "/job/netrunner/"
    },

    tech: {
        label: "Техник",
        ability: "<b>Мастер</b><br>Техник может чинить, улучшать, модифицировать, изготовлять и изобретать новые предметы, используя свою Ролевую Способность \"Мастер\". Каждый раз, когда Техник повышает свой ранг “Создатель”, он получает 1 ранг в двух разных Специализациях (Полевая экспертиза, Мастер модернизации, Мастер изготовления или Мастер изобретатель) на свой выбор.",
        link: "/job/tech/"
    },

    fixer: {
        label: "Фиксер",
        ability: "<b>Воротила</b><br>Ролевая способность Фиксера - Воротила.<br>Фиксеры знают, как достать необходимые вещи на черном рынке, и прекрасно разбираются в сложных социальных обычаях \"Улицы\", где сталкиваются сотни культур и разные экономические уровни. Фиксеры поддерживают обширную сеть связей и клиентов.",
        link: "/job/fixer/"
    },

    nomad: {
        label: "Кочевник",
        ability: "<b>Мото</b><br>Быть членом семьи Кочевников означает провести жизнь на водительском месте или под капотом, совершенствуя свои способности к вождению и знание транспорта настолько, что можно обойтись одним лишь знакомством или обучением, чтобы с легкостью совершать впечатляющие подвиги.<br><b>Кочевник добавляет свой ранг Мото к любой проверке навыков вождения наземной техники, пилотирования воздушной техники, управления морской техники, или ТЕХ-навыков воздушной техники, наземной техники или морской техники.</b>",
        link: "/job/nomad/"
    },

    rockerboy: {
        label: "Рокербой",
        ability: "<b>Харизматическое Давление</b><br>Ролевая способность Рокербоя — Харизматическое Давление. Обладая этой способностью, они могут влиять на других лишь своей выразительностью.<br>Не обязательно быть музыкантом. Они могут влиять на людей посредством поэзии, искусства, танца или просто своим присутствием. Это может быть рокер или лидер культа. По мере роста своего мастерства они могут воздействовать на все более и более крупные группы и призывать своих поклонников на все большие и большие свершения.",
        link: "/job/rocker/"
    },

    media: {
        label: "Медиа",
        ability: "<b>Доверие</b><br>Ролевая способность Медиа – это Доверие. Медиа могут не только убедить аудиторию в правдивости того, что они публикуют, чем больше доверия они вызывают, тем большую аудиторию они получают. Медиа также имеют более высокий уровень доступа к источникам и информации, они всегда в курсе и держат ухо в остро, чтобы быстро улавливать слухи и информацию.",
        link: "/job/media/"
    },

    lawman: {
        label: "Законник",
        ability: "<b>Подкрепление</b><br>Ролевая способность законника - Подкрепление. Законник может призвать на помощь группу своих коллег по правопорядку, в зависимости от ранга законника и условий, при которых происходит вызов. Подкрепление будет вооружено и бронировано в соответствии с таблицей ниже, управляет ими ГМ.<br>По мере повышения ранга законника, он, скорее всего, получит повышение в своей текущей организации или будет завербован правоохранительными органами, из которых он в данный момент может вызвать подкрепление.",
        link: "/job/cop/"
    },

    exec: {
        label: "Корпорат",
        ability: "<b>Командная Работа</b><br>Как и настоящий корпоративный руководитель, Корпорат создает команду, члены которой помогают ему достичь своих целей, независимо от того, законно это или нет, моральный дух позволяет. Ролевая способность Корпората - \"Командная Работа\". Вы Exec, что является дословно “менеджер”, но не тот, что по продажам, а управляющий. Это руководитель среднего звена, с подчиненными.",
        link: "/job/suit/"
    },

    medtech: {
        label: "Медтех",
        ability: "<b>Медицина</b><br>Благодаря своим знаниям и обучению медтехники поддерживают жизнь людей, которые были бы уже мертвы. В Красное время они в равной степени механики и врачи, заботящиеся о людях, которые зачастую больше машины, чем люди. Ролевая способность Медтехника - Медицина.<br>Каждый раз, когда медтех повышает свой ранг медицины, он также выбирает одну из следующих трех медицинских специальностей (Хирургия, Медицинские технологии - Фармацевтика и Медицинские технологии - Криосистемы), на которую можно потратить 1 очко.<br>Медицина содержит возможности использования навыков хирургии и медтехники, которые доступны только медтехникам благодаря этой ролевой способности. К ним относятся установка и сбор Киберимплантов, Бодискульптинг и Терапия!",
        link: "/job/medic/"
    }
};
